/*
	솔루션 / 프로젝트 / 소스파일: Ch05 / Prj13 / priority.c
	연산자의 우선순위는 괄호를 먼저 계산하고 사칙연산순서대로 가고 왼쪽에서 오른쪽으로 진행하면서 계산한다. 단 제곱승과 같은 정해진 연산은 오른쪽에서 왼쪽으로 계산한다.
	콤마 < 대입 < 조건(삼항) < 논리 < 관계 < 산술 < 단항 < 괄호와 대괄호 순서이다
	V 1.0 2022.
*/



#include <stdio.h>

int main(void)
{
	int a = 4, b = 6;
	double x = 3.3, y = 4.7;

	printf("%d ", a + b > y && x < y);		//산술 > 관계 > 논리
	printf("%d ", a++ - --b * 2);			//단항 > 곱셈 > 뺄셈
	printf("%f ", a > b ? x + 1 : y * 2);   //산술 > 관계 > 조건
	printf("%f ", x += 3 && y + 2);         //산술 > 논리 > 대입
	printf("%f\n", (x = x + 1, y = y + 1));	//괄호 > 산술 > 대입 > 콤마


	return 0;



}